package SRP;

// SRP (Single Responsibility Principle) — это принцип единственной ответственности,
// один из пяти принципов SOLID в объектно-ориентированном программировании.
// Каждый класс должен иметь только одну причину для изменения, то есть одну ответственность. Это означает, что класс должен выполнять только одну задачу и не совмещать несколько несвязанных функций.

// Плохой пример: один класс решает две задачи
public class UserManager {
//	public void addUser(User user) { // *Добавление пользователя* }	
//	public void sendEmail(User user, String message) {// *Отправка письма *}
}